<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of SMART Notebook 11 and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.smartnotebook11</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Utilities</string>
        <key>MUNKI_CATEGORY</key>
        <string>Productivity</string>
        <key>NAME</key>
        <string>SMART Tools Notebook</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>SMART Technologies</string>
            <key>display_name</key>
            <string>SMART Board Tools + Notebook</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
/usr/libexec/ApplicationFirewall/socketfilterfw --add '/Applications/SMART Technologies/SMART Settings.app/Contents/bin/SMARTBoardService.app'
            </string>
    		<key>description</key>
    		<string>Create, deliver and manage interactive lessons with SMART Notebook software.</string>
    		<key>name</key>
    		<string>%NAME%</string>
            <key>display_name</key>
            <string>SMART Board Tools + Notebook</string>
    		<key>unattended_install</key>
    		<true/>
            <key>uninstall_script</key>
            <string>#!/bin/sh
/Applications/SMART\ Technologies/SMART\ Uninstaller.app/Contents/Resources/uninstall --all
            </string>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.download.smartnotebook11</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>